from config import OWNER_USERNAME, SUPPORT_GRP
from savvychat import savvychat

START = f"""
**๏ ʜᴇʏ,\n\n ɪ ᴀᴍ {savvychat.name}💞\n🥀ʜᴏᴡ ᴀʀᴇ ʏᴏᴜ...??
"""

HELP_READ = f"""
<u>**ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {savvychat.name}**</u>
<u>**ᴀʀᴇ ɢɪᴠᴇɴ ʙᴇʟᴏᴡ!**</u>
**ᴀʟʟ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ:**
**──────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

TOOLS_DATA_READ = f"""
<u>**ᴛᴏᴏʟs ғᴏʀ {savvychat.name} ᴀʀᴇ:**</u>
**➻ ᴜsᴇ /sᴛᴀʀᴛ ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʙᴏᴛ ɪs ᴀʟɪᴠᴇ**
**──────────────**
**➻ ᴜsᴇ /ping ғᴏʀ ᴄʜᴇᴄᴋɪɴɢ ᴛʜᴇ ᴘɪɴɢ ᴏғ {savvychat.name}**
**──────────────**
**➻ ᴜsᴇ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴀ sɪɴɢʟᴇ ᴍᴇssᴀɢᴇ.**
**──────────────**
**➻ ᴜsᴇ /ᴡᴀɪғᴜ ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ʀᴀɴᴅᴏᴍ ᴡᴀɪғᴜ ᴘɪᴄs**
**──────────────**
**➻ ᴜsᴇ /bard ғᴏʀ ᴜsɪɴɢ ʙᴀʀᴅ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /ᴅᴀʀᴇ ғᴏʀ ɢɪᴠɪɴɢ sᴏᴍᴇᴏɴᴇ ᴀ ᴅᴀʀᴇ**
**──────────────**
**➻ ᴜsᴇ /ᴛɢᴍ ᴏʀ /ᴛᴇʟᴇɢʀᴀᴘʜ ғᴏʀ ᴜᴘʟᴏᴀᴅɪɴɢ ᴍᴇᴅɪᴀ ᴏʀ ᴛᴇxᴛ ᴏɴ ᴛᴇʟᴇɢʀᴀᴘʜ.ᴏʀɢ**
**──────────────**
**➻ ᴜsᴇ /blackbox ғᴏʀ ᴜsɪɴɢ ʙʟᴀᴄᴋʙᴏx.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /ɪᴍᴀɢᴇ ғᴏʀ sᴇᴀʀᴄʜ ɪᴍᴀɢᴇ ᴏɴ ᴘɪɴᴛᴇʀᴇsᴛ**
**──────────────**
**➻ ᴜsᴇ /ᴅᴇᴇᴘ ғᴏʀ ᴜsɪɴɢ ᴅᴇᴇᴘ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /ᴄʜᴀᴛɢᴘᴛ ᴏʀ /ᴀsᴋ  ғᴏʀ ᴜsɪɴɢ ᴄʜᴀᴛɢᴘᴛ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /ʙɪɴɢsᴇᴀʀᴄʜ ғᴏʀ ᴜsɪɴɢ ʙɪɴɢ.ᴀɪ** 
**──────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

CHATBOT_READ = f"""
<u>**ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {savvychat.name}**</u>
**➻ ᴜsᴇ /chatbot ᴛᴏ ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.**
**๏ ɴᴏᴛᴇ ➻ ᴛʜᴇ ᴀʙᴏᴠᴇ ᴄᴏᴍᴍᴀɴᴅ ғᴏʀ ᴄʜᴀᴛʙᴏᴛ ᴡᴏʀᴋ ɪɴ ɢʀᴏᴜᴘ ᴏɴʟʏ!!**
**───────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

ADMIN_READ = f"sᴏᴏɴ"

ABOUT_READ = f"""
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ɪs ᴀɴ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛ-ʙᴏᴛ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʜᴀᴠᴇ ᴍᴀɴʏ ᴀɪ ᴍᴏᴅᴇʟs sᴜᴄʜ ᴀs ᴄʜᴀᴛɢᴘᴛ,ʙɪɴɢ,ʙʟᴀᴄᴋʙᴏx,ʙᴀʀᴅ ᴀɴᴅ sᴏ ᴏɴ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʜᴇʟᴘs ɪɴ sᴏʟᴠɪɴɢ ᴘʀᴏʙʟᴇᴍs ᴀɴᴅ ᴇxᴘʟᴀɪɴɪɴɢ ᴛᴏᴘɪᴄs ʀᴇʟᴀᴛᴇᴅ ᴛᴏ sᴛᴜᴅʏ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʀᴇᴘʟɪᴇs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴜsᴇʀ.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{savvychat.name}](https://t.me/{savvychat.username})**
"""
