from config import OWNER_USERNAME, SUPPORT_GRP
from savvychat import savvychat

START = f"""**๏ ʜᴇʏ,()**\n**ɪ ᴀᴍ {savvychat.name}💞**\n**ʏᴏᴜʀ ᴀɪ ᴄᴏᴍᴘᴀɴɪᴏɴ.**\n**ʟᴇᴛ'ꜱ ᴄʜᴀᴛ ᴀɴᴅ ᴇxᴘʟᴏʀᴇ.**\n**ᴛʜᴇ ᴅᴇᴘᴛʜꜱ ᴏꜰ ᴄᴏɴᴠᴇʀꜱᴀᴛɪᴏɴ ᴛᴏɢᴇᴛʜᴇʀ!**\n**ꜰᴇᴇʟ ꜰʀᴇᴇ ᴛᴏ ᴀꜱᴋ ᴍᴇ ᴀɴʏᴛʜɪɴɢ ᴏʀ ꜱʜᴀʀᴇ ʏᴏᴜʀ ᴛʜᴏᴜɢʜᴛꜱ.**\n**ɪ'ᴍ ʜᴇʀᴇ ᴛᴏ ʟɪꜱᴛᴇɴ ᴀɴᴅ ᴇɴɢᴀɢᴇ ɪɴ ᴍᴇᴀɴɪɴɢꜰᴜʟ ᴅɪꜱᴄᴜꜱꜱɪᴏɴꜱ ᴡɪᴛʜ ʏᴏᴜ.**\n** ________________________________________**\n**ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴛʏᴘᴇ /help ɪɴ ᴍʏ ᴘᴍ**\n**________________________________________**
                  """

HELP_READ = f"""
<u>**ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {savvychat.name}**</u>
<u>**ᴀʀᴇ ɢɪᴠᴇɴ ʙᴇʟᴏᴡ!**</u>
**ᴀʟʟ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ:**
**──────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

TOOLS_DATA_READ = f"""
<u>**ᴛᴏᴏʟs ғᴏʀ {savvychat.name} ᴀʀᴇ:**</u>
**➻ ᴜsᴇ /start ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʙᴏᴛ ɪs ᴀʟɪᴠᴇ**
**──────────────**
**➻ ᴜsᴇ /ping ғᴏʀ ᴄʜᴇᴄᴋɪɴɢ ᴛʜᴇ ᴘɪɴɢ ᴏғ {savvychat.name}**
**──────────────**
**➻ ᴜsᴇ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴀ sɪɴɢʟᴇ ᴍᴇssᴀɢᴇ.**
**──────────────**
**➻ ᴜsᴇ /waifu ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ʀᴀɴᴅᴏᴍ ᴡᴀɪғᴜ ᴘɪᴄs**
**──────────────**
**➻ ᴜsᴇ /bard ғᴏʀ ᴜsɪɴɢ ʙᴀʀᴅ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /joke ғᴏʀ ʀᴀɴᴅᴏᴍ ᴊᴏᴋᴇs**
**──────────────**
**➻ ᴜsᴇ /ᴛɢᴍ ᴏʀ /ᴛᴇʟᴇɢʀᴀᴘʜ ғᴏʀ ᴜᴘʟᴏᴀᴅɪɴɢ ᴍᴇᴅɪᴀ ᴏʀ ᴛᴇxᴛ ᴏɴ ᴛᴇʟᴇɢʀᴀᴘʜ.ᴏʀɢ**
**──────────────**
**➻ ᴜsᴇ /blackbox ғᴏʀ ᴜsɪɴɢ ʙʟᴀᴄᴋʙᴏx.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /image ғᴏʀ sᴇᴀʀᴄʜ ɪᴍᴀɢᴇ ᴏɴ ᴘɪɴᴛᴇʀᴇsᴛ**
**──────────────**
**➻ ᴜsᴇ /deep ғᴏʀ ᴜsɪɴɢ ᴅᴇᴇᴘ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /chatgpt ᴏʀ /ask ғᴏʀ ᴜsɪɴɢ ᴄʜᴀᴛɢᴘᴛ.ᴀɪ**
**──────────────**
**➻ ᴜsᴇ /bingsearch  ғᴏʀ ᴜsɪɴɢ ʙɪɴɢ ** 
**──────────────**
**➻ ᴜsᴇ /cosplay or /ncosplay ғᴏʀ ʀᴀɴᴅᴏᴍ ᴄᴏsᴘʟᴀʏs** 
**──────────────**
**➻ ᴜsᴇ /write ғᴏʀ ᴡʀɪᴛᴇ ᴀɴʏᴛʜɪɴɢ ᴏɴ ᴘᴀᴘᴇʀ ᴡɪᴛʜ ᴘᴇɴ ᴜsɪɴɢ ᴀɪ.** 
**──────────────**
**➻ ᴜsᴇ /yt ᴏʀ /video ғᴏʀ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ʏᴏᴜᴛᴜʙᴇ ᴠɪᴅᴇᴏs ** 
**──────────────**
**➻ ᴜsᴇ /ig ᴏʀ /reel ғᴏʀ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ɪɴsᴛᴀ ʀᴇᴇʟs** 
**──────────────**
**➻ ᴜsᴇ /groupinfo ᴏʀ /groupdata ғᴏʀ ɢʀᴏᴜᴘs ᴅᴇᴛᴀɪʟs** 
**──────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

CHATBOT_READ = f"""
<u>**ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {savvychat.name}**</u>
**➻ ᴜsᴇ /chatbot ᴛᴏ ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.**
**๏ ɴᴏᴛᴇ ➻ ᴛʜᴇ ᴀʙᴏᴠᴇ ᴄᴏᴍᴍᴀɴᴅ ғᴏʀ ᴄʜᴀᴛʙᴏᴛ ᴡᴏʀᴋ ɪɴ ɢʀᴏᴜᴘ ᴏɴʟʏ!!**
**───────────────**
<b>||©️ 𝕯𝖎𝖛𝖞𝖆𝖓𝖘𝖍𝖚 𝕽𝖆𝖓𝖆||</b>
"""

ADMIN_READ = f"sᴏᴏɴ"

ABOUT_READ = f"""
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ɪs ᴀɴ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛ-ʙᴏᴛ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʜᴀᴠᴇ ᴍᴀɴʏ ᴀɪ ᴍᴏᴅᴇʟs sᴜᴄʜ ᴀs ᴄʜᴀᴛɢᴘᴛ,ʙɪɴɢ,ʙʟᴀᴄᴋʙᴏx,ʙᴀʀᴅ ᴀɴᴅ sᴏ ᴏɴ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʜᴇʟᴘs ɪɴ sᴏʟᴠɪɴɢ ᴘʀᴏʙʟᴇᴍs ᴀɴᴅ ᴇxᴘʟᴀɪɴɪɴɢ ᴛᴏᴘɪᴄs ʀᴇʟᴀᴛᴇᴅ ᴛᴏ sᴛᴜᴅʏ.**
**➻ [{savvychat.name}](https://t.me/{savvychat.username}) ʀᴇᴘʟɪᴇs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴜsᴇʀ.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{savvychat.name}](https://t.me/{savvychat.username})**
"""
